### 以openml中的数据集1StudentPerformance为例，将数据集拆分成两个子集（变量拆分），样本是从原数据集中重抽样所得，将这两个子集按列合并，默认键是行索引index。

In [1]:
# 导入数据集获取工具
from sklearn.datasets import fetch_openml
# 导入数据分析库
import pandas as pd

In [2]:
# 获取数据
data = fetch_openml(
    data_id=43255,
    as_frame=True,
    parser="pandas"
)["frame"]

In [3]:
# 查看数据集的前五行
data.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor\'s degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master\'s degree,standard,none,90,95,93
3,male,group A,associate\'s degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [4]:
# 重抽样
data1 = data.iloc[:, :4].sample(n=50, replace=True, random_state=1)
data2 = data.iloc[:, 4:].sample(n=50, replace=True, random_state=2)
# 按列合并，默认的key是Index，取并集，以缺失值填充
newdata1 = pd.concat([data1, data2], axis=1, join="outer")
newdata1.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
37,female,group D,some high school,free/reduced,NaN,NaN,NaN,NaN
235,male,group D,associate\'s degree,standard,NaN,NaN,NaN,NaN
908,female,group C,bachelor\'s degree,free/reduced,NaN,NaN,NaN,NaN
72,female,group A,associate\'s degree,free/reduced,NaN,NaN,NaN,NaN
767,male,group B,high school,standard,NaN,NaN,NaN,NaN

In [5]:
# 按列合并，默认的key是Index，取交集，无缺失值
newdata2 = pd.concat([data1, data2], axis=1, join="inner")
newdata2.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
534,male,group B,high school,standard,completed,73,69,68